{
  "year": 2026,
  "category": "ruxailab",
  "projects": [
    {
      "title": "Unified Logging and Traceability System for Usability Studies",
      "size": "medium",
      "hours": 175,
      "description": "This project aims to implement a structured logging and traceability system that records all relevant events during a usability study lifecycle.",
      "keyFeatures": [
        "Study Lifecycle Logging",
        "Multi-Layer Logs (technical, methodological, AI decisions)",
        "Research Traceability",
        "Export & Visualization Tools",
        "Ethics & Anonymization Support"
      ],
      "expectedOutcome": "A comprehensive logging framework for scientific-grade usability research.",
      "keywords": ["Logging Systems", "Research Traceability", "UX Evaluation", "Software Architecture"],
      "skills": ["Python", "Backend Development", "Software Architecture"],
      "mentor": "Marc",
      "difficulty": "Medium"
    },
    {
      "title": "Implementation of A/B Testing Capability in RUXAILAB",
      "size": "medium",
      "hours": 175,
      "description": "This project focuses on implementing A/B testing functionality within RUXAILAB to enhance usability evaluation and data-driven decision-making. The goal is to provide an integrated system for running controlled experiments, comparing different UI designs, and gathering insights on user preferences.",
      "keyFeatures": [
        "Automated A/B Test Setup: Allow testers to configure and manage A/B tests within RUXAILAB",
        "Real-Time Performance Tracking: Collect user interaction data for different variations",
        "Statistical Analysis Module: Provide insights on test results using key performance indicators",
        "User Segmentation: Enable tests based on demographic, behavior, or experience level",
        "Seamless UI Integration: Ensure compatibility with existing usability testing workflows"
      ],
      "expectedOutcome": "A fully integrated A/B testing module that allows usability researchers to conduct controlled experiments and make data-driven design decisions in RUXAILAB",
      "keywords": ["A/B Testing", "User Experience", "Usability Testing", "Data Analysis", "Front-End Development"],
      "skills": ["JavaScript", "Python", "Data Analysis", "UI/UX Testing"],
      "mentor": "Igor",
      "difficulty": "Medium"
    },
    {
      "title": "Enhancing Playwright Testing in RUXAILAB",
      "size": "small",
      "hours": 90,
      "description": "This project aims to refine and optimize Playwright-based automated testing in RUXAILAB, improving test efficiency and documentation to enhance maintainability and ease of use. The focus will be on ensuring robust test coverage, optimizing test workflows, and developing comprehensive documentation to support contributors.",
      "keyFeatures": [
        "Improving Test Maintainability: Refactor test scripts for better reusability and efficiency",
        "Cross-Browser and Device Compatibility: Ensure consistent behavior across different browsers and devices",
        "Accessibility Testing Enhancements: Strengthen WCAG compliance validation for UI components",
        "Comprehensive Documentation: Develop detailed guides on test creation, execution, and maintenance",
        "Integration with CI/CD Pipelines: Enhance GitHub Actions workflows for streamlined automated testing"
      ],
      "expectedOutcome": "A more maintainable and well-documented Playwright testing framework, ensuring long-term usability and ease of contribution in RUXAILAB",
      "keywords": ["Playwright", "Automated Testing", "UI Testing", "Accessibility", "Documentation"],
      "skills": ["JavaScript", "Playwright", "Automated Testing", "CI/CD", "GitHub Actions", "Technical Writing"],
      "mentor": "Eric",
      "difficulty": "Easy"
    },
     {
      "title": "Cognitive Walkthrough Evaluation Module",
      "size": "medium",
      "hours": 175,
      "description": "This project aims to implement Cognitive Walkthrough as a core usability evaluation methodology in RUXAILAB. The focus is on systematically evaluating task learnability by analyzing whether users can understand and successfully perform actions step by step, especially during first-time or infrequent use.",
      "keyFeatures": [
        "Task-Centered Evaluation Flow: Guide evaluators through predefined tasks broken into interaction steps",
        "Standard Cognitive Walkthrough Questions: Support classic questions related to goal formation, action visibility, feedback interpretation, and system response",
        "Learnability Issue Capture: Record breakdowns related to discoverability, affordances, and user expectations",
        "Structured Findings Model: Store issues linked to specific steps, heuristics, and severity levels",
        "Integrated Reporting: Generate walkthrough-specific reports compatible with RUXAILAB’s reporting system"
      ],
      "expectedOutcome": "A fully integrated Cognitive Walkthrough module that enables systematic identification of learnability and first-use usability problems in digital interfaces.",
      "keywords": [
        "Cognitive Walkthrough",
        "Learnability",
        "Usability Evaluation",
        "Human-Computer Interaction",
        "UX Research"
      ],
      "skills": [
        "Python",
        "UX Research Methods",
        "Frontend Development"
      ],
      "mentor": "Marc",
      "difficulty": "Medium"
    },
    {
      "title": "Focus Group Management and Analysis Module",
      "size": "medium",
      "hours": 175,
      "description": "This project focuses on implementing Focus Group support in RUXAILAB, enabling structured collection and analysis of qualitative insights gathered through moderated group discussions. The goal is to support early-stage exploration, concept validation, and collective reflection on user experiences.",
      "keyFeatures": [
        "Session Configuration Tools: Define focus group objectives, discussion guides, and participant roles",
        "Multi-Participant Data Capture: Support notes, timestamps, transcriptions, and optional audio/video references",
        "Thematic Structuring: Organize observations by topics, prompts, and emerging themes",
        "Consensus and Divergence Tracking: Highlight shared opinions and conflicting perspectives across participants",
        "NLP-Assisted Analysis: Apply basic NLP to cluster themes and summarize discussion outcomes"
      ],
      "expectedOutcome": "A Focus Group module that enables systematic collection, structuring, and analysis of qualitative group-based usability insights within RUXAILAB.",
      "keywords": [
        "Focus Groups",
        "Qualitative Research",
        "Usability Evaluation",
        "UX Research",
        "NLP"
      ],
      "skills": [
        "Python",
        "UX Research Methods",
        "NLP (basic)",
        "Frontend Development"
      ],
      "mentor": "Marc",
      "difficulty": "Medium"
    }
  ]
}
